<section class="my-section py-section bg-bg-main-dark overflow-hidden">
    <div class="container">
        <div class="flex flex-col py-section" data-stages>
            <h2 class="title title-h2 text-main-dark">Этапы работы над проектом</h2>
            <p class="max-w-[600px] text-body-dark mt-3 desktop:mt-6">
                Каждый проект для нас как родной. Мы любим свою работу и с трепетом относимся к каждому клиенту. Предварительные выводы неутешительны: понимание сути ресурсосберегающих.
            </p>
            
            <div class="swiper w-full mt-6 desktop:mt-[176px] overflow-visible">
                <div class="swiper-wrapper">
                    <x-stage-card num="1" title="Первичное обращение" description="Чтобы воспользоваться нашими услугами, оставьте заявку на сайте, позвоните на телефон или воспользуйтесь одним из удобных для вас мессенджеров"></x-stage-card>
                    <x-stage-card num="2" title="Знакомство и обсуждение задач" description="Когда вы оставите заявку, мы в кратчайшие сроки ознакомимся с особенностями вашего проекта. После заполнения брифа, обсуждения задач и подписания договора вам будет выставлен счет на предоплату"></x-stage-card>
                    <x-stage-card num="3" title="Анализ и сбор информации" description="Анализируем конкурентов, выявляя их сильные и слабые стороны. Основываясь на полученных данных, формируем ТЗ и собираем необходимую информацию по вашему бизнесу"></x-stage-card>
                    <x-stage-card num="4" title="Проектирование и дизайн" description="Разработка прототипа и пользовательских сценариев. Создание дизайн концепции и отрисовка всех необходимых макетов дизайна"></x-stage-card>
                    <x-stage-card num="5" title="Верстка и код" description="Адаптивная верстка, программирование функционала на CMS или PHP-фреймворке, интеграция с внешними сервисами"></x-stage-card>
                    <x-stage-card num="6" title="Тестирование и наполнение" description="Тестирование отображения верстки и работы функционала. Наполнение сайта контентом. Базовая SEO-оптимизация"></x-stage-card>
                    <x-stage-card num="7" title="Запуск проекта" description="Выгрузка сайта на боевой сервер. Добавление сайта в поисковые системы. Подключение метрики и других необходимых скриптов. Обучение по управлению админ. панели"></x-stage-card>
                    <x-stage-card num="8" title="Поддержка проекта" description="Гарантированная поддержка - 24 месяца. Консультация по всем вопросам"></x-stage-card>
                    <x-stage-card num="9" title="Продвижение проекта" description="Продвижением занимаются наши партнеры, в которых мы уверены, что они могут сделать качественный результат!" last="true"></x-stage-card>
                </div>
            </div>
        </div>
    </div>
</section>